In [10]:
import pandas as pd

In [11]:
df = pd.read_csv('SalaryData.csv')

In [12]:
df.head(10)

    Education       Occupation  Salary
0   Doctorate     Adm-clerical  153197
1   Doctorate     Adm-clerical  115945
2   Doctorate     Adm-clerical  175935
3   Doctorate     Adm-clerical  220754
4   Doctorate            Sales  170769
5   Doctorate            Sales  219420
6   Doctorate            Sales  237920
7   Doctorate            Sales  160540
8   Doctorate            Sales  180934
9   Doctorate   Prof-specialty  248156

In [37]:
import statsmodels.api as sm
from statsmodels.formula.api import ols
import warnings
warnings.filterwarnings('ignore')

#perform two-way ANOVA
model = ols('Salary ~ C(Education) + C(Occupation) + C(Education):C(Occupation)', data=df).fit()
ANOVA_Table = sm.stats.anova_lm(model, typ=2)

In [38]:
print(ANOVA_Table.round(5))

                                  sum_sq    df          F   PR(>F)
C(Education)                1.938753e+11   2.0  136.32652  0.00000
C(Occupation)               4.077417e+08   3.0    0.19114  0.82705
C(Education):C(Occupation)  4.227791e+10   6.0    9.90946  0.00001
Residual                    2.062102e+10  29.0        NaN      NaN

In [ ]:
We can see the following p-values for each of the factors in the table:

water: p-value = .000527
sun: p-value = .0000002
water*sun: p-value = .120667
Since the p-values for water and sun are both less than .05, this means that both factors have a statistically significant effect on plant height.

And since the p-value for the interaction effect (.120667) is not less than .05, this tells us that there is no significant interaction effect between sunlight exposure and watering frequency.

In [31]:
round(result['PR(>F)'],10) # get the p value upto 10 decimal places.

C(Education)                  0.000000
C(Occupation)                 0.827049
C(Education):C(Occupation)    0.000013
Residual                           NaN
Name: PR(>F), dtype: float64

In [21]:
print('%.08f' % )

23.36547855

In [42]:
data_crosstab = pd.crosstab(data['Death'],
                            data['Sex'], 
                               margins = False)
print(data_crosstab)

Sex      1    2
Death
0      184  266
1      308  242

In [43]:
data_crosstab = pd.crosstab(data['Death'],
                            data['Educ'], 
                               margins = False)
print(data_crosstab)

Educ     1    2   3   4
Death
0      173  146  84  47
1      287  135  80  48

In [39]:
data = pd.read_csv("framingham_nb_training.csv")

In [40]:
data.head()

   Sex  Educ  Death
0    2     3      0
1    2     2      0
2    1     1      0
3    2     1      0
4    2     1      0

In [46]:
codes, uniques = pd.factorize(data.Sex)

In [50]:
for i in range(10):
    print((9-i)*' '+(i+1)*'*')

         *
        **
       ***
      ****
     *****
    ******
   *******
  ********
 *********
**********